In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

![join](./img/joins.png)

## INNER JOIN

![inner join](./img/inner_join.png)

In [13]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35],
             'Country':['Pakistan', 'India', 'KSA', 'USA']}

In [14]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units   Country
0  01-01-2020          1     40  Pakistan
1  02-01-2020          1     25     India
2  03-01-2020          3     30       KSA
3  04-01-2020          2     35       USA

In [15]:
right_table = {'CountryID': [3,4],
              'Country': ['Panama', 'Spain']}

In [16]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   CountryID  Country
0          3  Pandama
1          4    Spain

In [22]:
inner_df = left_table_df.merge(right_table_df, on='CountryID',suffixes=['left','right'],)
inner_df

         Date  CountryID  Units Countryleft Countryright
0  03-01-2020          3     30         KSA      Pandama

In [101]:
left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID').drop('ID', axis=1)

         Date  CountryID  Units  Country
0  03-01-2020          3     30  Pandama

## SEMI JOIN

In [27]:
left_table_df

         Date  CountryID  Units   Country
0  01-01-2020          1     40  Pakistan
1  02-01-2020          1     25     India
2  03-01-2020          3     30       KSA
3  04-01-2020          2     35       USA

In [29]:
left_table_df.drop('Country', axis = 1, inplace=True)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [30]:
right_table_df

   CountryID  Country
0          3  Pandama
1          4    Spain

- Return the intersection, similar to an inner join
- Return only column from left table and not the rigth
- No duplicated

In [34]:
left_table_df.merge(right_table_df, on='CountryID')[['CountryID', 'Country']].drop_duplicates(subset='CountryID')

   CountryID  Country
0          3  Pandama

## LEFT JOIN

![left join](./img/left_join.png)

In [35]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,4],
              'Units': [40, 25, 30, 35]}

In [36]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          4     35

In [37]:
right_table = {'ID': [1,2, 3],
              'Country': ['USA', 'Canada', 'Panama']}

In [38]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   1     USA
1   2  Canada
2   3  Panama

In [39]:
left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID', how='left').drop('ID', axis=1)

         Date  CountryID  Units Country
0  01-01-2020          1     40     USA
1  02-01-2020          1     25     USA
2  03-01-2020          3     30  Panama
3  04-01-2020          4     35     NaN

## RIGHT JOIN

![right join](./img/right_join.png)

In [40]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,4],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          4     35

In [45]:
right_table = {'CountryID': [3, 5],
              'Country': ['Pandama', 'Russia']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   CountryID  Country
0          3  Pandama
1          5   Russia

In [46]:
left_table_df.merge(right_table_df, on='CountryID', how='right')#.drop('ID', axis=1)

         Date  CountryID  Units  Country
0  03-01-2020          3   30.0  Pandama
1         NaN          5    NaN   Russia

## FULL/OUTER JOIN 

![full join](./img/full_outer_join.png)

In [47]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [48]:
right_table = {'ID': [1,2,3,4],
              'Country': ['USA', 'Canada', 'Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   1     USA
1   2  Canada
2   3  Panama
3   4   Spain

In [49]:
left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID', how='outer').drop('ID', axis=1)

         Date  CountryID  Units Country
0  01-01-2020        1.0   40.0     USA
1  02-01-2020        1.0   25.0     USA
2  04-01-2020        2.0   35.0  Canada
3  03-01-2020        3.0   30.0  Panama
4         NaN        NaN    NaN   Spain

## Left Anti Join

![left anti](./img/left_anti_join.png)

In [50]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [51]:
right_table = {'ID': [3,4],
              'Country': ['Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

In [52]:
left_join_df = left_table_df.merge(right_table_df,
                                   left_on="CountryID",
                                   right_on='ID',
                                   how='left', indicator=True).drop('ID', axis=1)

In [53]:
left_join_df

         Date  CountryID  Units Country     _merge
0  01-01-2020          1     40     NaN  left_only
1  02-01-2020          1     25     NaN  left_only
2  03-01-2020          3     30  Panama       both
3  04-01-2020          2     35     NaN  left_only

In [58]:
left_join_df[left_join_df['Country'].isnull()]

         Date  CountryID  Units Country     _merge
0  01-01-2020          1     40     NaN  left_only
1  02-01-2020          1     25     NaN  left_only
3  04-01-2020          2     35     NaN  left_only

In [59]:
left_join_df.loc[left_join_df['_merge'] == 'left_only']

         Date  CountryID  Units Country     _merge
0  01-01-2020          1     40     NaN  left_only
1  02-01-2020          1     25     NaN  left_only
3  04-01-2020          2     35     NaN  left_only

In [63]:
left_only_ids = left_join_df.loc[left_join_df['_merge'] == 'left_only']['CountryID']
left_only_ids

0    1
1    1
3    2
Name: CountryID, dtype: int64

In [66]:
left_join_df[left_join_df['CountryID'].isin(left_only_ids)]

         Date  CountryID  Units Country     _merge
0  01-01-2020          1     40     NaN  left_only
1  02-01-2020          1     25     NaN  left_only
3  04-01-2020          2     35     NaN  left_only

## Right Anti Join

![right anti join](./img/right_anti_join.png)

In [64]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [65]:
right_table = {'ID': [3,4],
              'Country': ['Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

In [68]:
right_join_df = left_table_df.merge(right_table_df,
                                   left_on="CountryID",
                                   right_on='ID',
                                   how='right', indicator=True).drop('ID', axis=1)
right_join_df

         Date  CountryID  Units Country      _merge
0  03-01-2020        3.0   30.0  Panama        both
1         NaN        NaN    NaN   Spain  right_only

In [72]:
right_join_df[right_join_df['Units'].isnull()]

  Date  CountryID  Units Country      _merge
1  NaN        NaN    NaN   Spain  right_only

In [73]:
right_join_df.loc[right_join_df['_merge'] == 'right_only']

  Date  CountryID  Units Country      _merge
1  NaN        NaN    NaN   Spain  right_only

## Concatenation
- pandas **.concat()** can concatenate both vertically and horizentally
- **axis=0** for vertical

In [74]:
left_join_df

         Date  CountryID  Units Country     _merge
0  01-01-2020          1     40     NaN  left_only
1  02-01-2020          1     25     NaN  left_only
2  03-01-2020          3     30  Panama       both
3  04-01-2020          2     35     NaN  left_only

In [77]:
right_join_df['ABC'] = 0

In [80]:
pd.concat([left_join_df, right_join_df], ignore_index=False, keys=['left_', 'right_'])

                Date  CountryID  Units Country      _merge  ABC
left_  0  01-01-2020        1.0   40.0     NaN   left_only  NaN
       1  02-01-2020        1.0   25.0     NaN   left_only  NaN
       2  03-01-2020        3.0   30.0  Panama        both  NaN
       3  04-01-2020        2.0   35.0     NaN   left_only  NaN
right_ 0  03-01-2020        3.0   30.0  Panama        both  0.0
       1         NaN        NaN    NaN   Spain  right_only  0.0

## Using append method
**.append()**
- Simplified version of **.concat()**
- suppor : **sort_index** and **sort**
- Not support : **keys** and **join** i:e. always **join == outer**

`Dataframe.append has been depreceated in the pandas>1.4`